HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSmu_bf.h
/** \brief Offset for Ifx_SMU_AFCNT_Bits.FCO */
#define IFX_SMU_AFCNT_FCO_OFF (30u)

/** \brief Length for Ifx_SMU_AFCNT_Bits.ACO */
#define IFX_SMU_AFCNT_ACO_LEN (1u)

/** \brief Mask for Ifx_SMU_AFCNT_Bits.ACO */
#define IFX_SMU_AFCNT_ACO_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AFCNT_Bits.ACO */
#define IFX_SMU_AFCNT_ACO_OFF (31u)

/** \brief Length for Ifx_SMU_RTAC00_Bits.GID0 */
#define IFX_SMU_RTAC00_GID0_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC00_Bits.GID0 */
#define IFX_SMU_RTAC00_GID0_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC00_Bits.GID0 */
#define IFX_SMU_RTAC00_GID0_OFF (0u)

/** \brief Length for Ifx_SMU_RTAC00_Bits.ALID0 */
#define IFX_SMU_RTAC00_ALID0_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC00_Bits.ALID0 */
#define IFX_SMU_RTAC00_ALID0_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC00_Bits.ALID0 */
#define IFX_SMU_RTAC00_ALID0_OFF (4u)

/** \brief Length for Ifx_SMU_RTAC00_Bits.GID1 */
#define IFX_SMU_RTAC00_GID1_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC00_Bits.GID1 */
#define IFX_SMU_RTAC00_GID1_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC00_Bits.GID1 */
#define IFX_SMU_RTAC00_GID1_OFF (16u)

/** \brief Length for Ifx_SMU_RTAC00_Bits.ALID1 */
#define IFX_SMU_RTAC00_ALID1_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC00_Bits.ALID1 */
#define IFX_SMU_RTAC00_ALID1_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC00_Bits.ALID1 */
#define IFX_SMU_RTAC00_ALID1_OFF (20u)

/** \brief Length for Ifx_SMU_RTAC01_Bits.GID2 */
#define IFX_SMU_RTAC01_GID2_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC01_Bits.GID2 */
#define IFX_SMU_RTAC01_GID2_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC01_Bits.GID2 */
#define IFX_SMU_RTAC01_GID2_OFF (0u)

/** \brief Length for Ifx_SMU_RTAC01_Bits.ALID2 */
#define IFX_SMU_RTAC01_ALID2_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC01_Bits.ALID2 */
#define IFX_SMU_RTAC01_ALID2_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC01_Bits.ALID2 */
#define IFX_SMU_RTAC01_ALID2_OFF (4u)

/** \brief Length for Ifx_SMU_RTAC01_Bits.GID3 */
#define IFX_SMU_RTAC01_GID3_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC01_Bits.GID3 */
#define IFX_SMU_RTAC01_GID3_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC01_Bits.GID3 */
#define IFX_SMU_RTAC01_GID3_OFF (16u)

/** \brief Length for Ifx_SMU_RTAC01_Bits.ALID3 */
#define IFX_SMU_RTAC01_ALID3_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC01_Bits.ALID3 */
#define IFX_SMU_RTAC01_ALID3_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC01_Bits.ALID3 */
#define IFX_SMU_RTAC01_ALID3_OFF (20u)

/** \brief Length for Ifx_SMU_RTAC10_Bits.GID0 */
#define IFX_SMU_RTAC10_GID0_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC10_Bits.GID0 */
#define IFX_SMU_RTAC10_GID0_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC10_Bits.GID0 */
#define IFX_SMU_RTAC10_GID0_OFF (0u)

/** \brief Length for Ifx_SMU_RTAC10_Bits.ALID0 */
#define IFX_SMU_RTAC10_ALID0_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC10_Bits.ALID0 */
#define IFX_SMU_RTAC10_ALID0_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC10_Bits.ALID0 */
#define IFX_SMU_RTAC10_ALID0_OFF (4u)

/** \brief Length for Ifx_SMU_RTAC10_Bits.GID1 */
#define IFX_SMU_RTAC10_GID1_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC10_Bits.GID1 */
#define IFX_SMU_RTAC10_GID1_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC10_Bits.GID1 */
#define IFX_SMU_RTAC10_GID1_OFF (16u)

/** \brief Length for Ifx_SMU_RTAC10_Bits.ALID1 */
#define IFX_SMU_RTAC10_ALID1_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC10_Bits.ALID1 */
#define IFX_SMU_RTAC10_ALID1_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC10_Bits.ALID1 */
#define IFX_SMU_RTAC10_ALID1_OFF (20u)

/** \brief Length for Ifx_SMU_RTAC11_Bits.GID2 */
#define IFX_SMU_RTAC11_GID2_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC11_Bits.GID2 */
#define IFX_SMU_RTAC11_GID2_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC11_Bits.GID2 */
#define IFX_SMU_RTAC11_GID2_OFF (0u)

/** \brief Length for Ifx_SMU_RTAC11_Bits.ALID2 */
#define IFX_SMU_RTAC11_ALID2_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC11_Bits.ALID2 */
#define IFX_SMU_RTAC11_ALID2_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC11_Bits.ALID2 */
#define IFX_SMU_RTAC11_ALID2_OFF (4u)

/** \brief Length for Ifx_SMU_RTAC11_Bits.GID3 */
#define IFX_SMU_RTAC11_GID3_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC11_Bits.GID3 */
#define IFX_SMU_RTAC11_GID3_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC11_Bits.GID3 */
#define IFX_SMU_RTAC11_GID3_OFF (16u)

/** \brief Length for Ifx_SMU_RTAC11_Bits.ALID3 */
#define IFX_SMU_RTAC11_ALID3_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC11_Bits.ALID3 */
#define IFX_SMU_RTAC11_ALID3_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC11_Bits.ALID3 */
#define IFX_SMU_RTAC11_ALID3_OFF (20u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_OFF (0u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_OFF (1u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_OFF (2u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_OFF (3u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_OFF (4u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_OFF (5u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_OFF (6u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_OFF (7u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_OFF (8u)

/** \brief Length for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_LEN (1u)

